{
	"articles": {
		"results": [
			{
				"uri": "9058454930",
				"lang": "eng",
				"isDuplicate": true,
				"date": "2026-01-25",
				"time": "10:43:22",
				"dateTime": "2026-01-25T10:43:22Z",
				"dateTimePub": "2026-01-25T09:22:48Z",
				"dataType": "news",
				"sim": 0,
				"url": "https://www.wralsportsfan.com/rangers-take-on-the-bruins-on-losing-streak/22307608/",
				"title": "Rangers take on the Bruins on losing streak",
				"body": "Boston Bruins (30-20-2, in the Atlantic Division) vs. New York Rangers (21-25-6, in the Metropolitan Division)\n\nNew York; Monday, 7 p.m. EST\n\nBOTTOM LINE: The New York Rangers look to stop a three-game slide when they play the Boston Bruins.\n\nNew York has gone 5-13-4 in home games and 21-25-6 overall. The Rangers have a -25 scoring differential, with 137 total goals scored and 162 given up.\n\nBoston is 30-20-2 overall and 11-12-1 in road games. The Bruins have scored 172 total goals (3.3 per game) to rank sixth in league play.\n\nThe teams meet Monday for the third time this season. The Bruins won 10-2 in the last matchup. Marat Khusnutdinov led the Bruins with four goals.\n\nTOP PERFORMERS: Mika Zibanejad has 21 goals and 27 assists for the Rangers. Artemi Panarin has five goals and 10 assists over the past 10 games.\n\nMorgan Geekie has 28 goals and 19 assists for the Bruins. Khusnutdinov has scored six goals and added three assists over the last 10 games.\n\nLAST 10 GAMES: Rangers: 2-7-1, averaging three goals, 5.3 assists, 3.6 penalties and 7.8 penalty minutes while giving up 4.2 goals per game.\n\nBruins: 8-2-0, averaging 4.1 goals, 7.5 assists, 3.7 penalties and 10 penalty minutes while giving up 2.5 goals per game.\n\nThe Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
				"source": {
					"uri": "wralsportsfan.com",
					"dataType": "news",
					"title": "WRALSportsFan.com"
				},
				"authors": [],
				"image": "https://wwwcache.wral.com/presentation/v3/images/content/social/open_graph/wral_news5_1920x1080.jpg",
				"eventUri": null,
				"sentiment": 0.1294117647058823,
				"wgt": 507033802,
				"relevance": 1
			},
			{
				"uri": "9058467696",
				"lang": "eng",
				"isDuplicate": true,
				"date": "2026-01-25",
				"time": "10:43:17",
				"dateTime": "2026-01-25T10:43:17Z",
				"dateTimePub": "2026-01-25T09:10:54Z",
				"dataType": "news",
				"sim": 0,
				"url": "https://www.hjnews.com/sports/nation/panthers-play-the-blackhawks-following-marchands-2-goal-game/article_ba367d7d-956f-555a-9186-45a5e94857f1.html",
				"title": "Panthers play the Blackhawks following Marchand's 2-goal game",
				"body": "The Florida Panthers visit the Chicago Blackhawks after Brad Marchand scored two goals in the Panthers' 4-3 overtime win over the Minnesota Wild\n\nFlorida Panthers (27-20-3, in the Atlantic Division) vs. Chicago Blackhawks (21-22-8, in the Central Division)\n\nChicago; Sunday, 7 p.m. EST\n\nBETMGM SPORTSBOOK LINE: Panthers -147, Blackhawks +123; over/under is 6\n\nBOTTOM LINE: The Florida Panthers visit the Chicago Blackhawks after Brad Marchand scored two goals in the Panthers' 4-3 overtime win against the Minnesota Wild.\n\nChicago is 11-12-5 at home and 21-22-8 overall. The Blackhawks have gone 6-7-4 in games decided by a goal.\n\nFlorida has a 27-20-3 record overall and a 13-10-0 record in road games. The Panthers have a -14 scoring differential, with 149 total goals scored and 163 allowed.\n\nThe teams match up Sunday for the second time this season. The Panthers won 3-2 in the previous matchup.\n\nTOP PERFORMERS: Connor Bedard has 20 goals and 27 assists for the Blackhawks. Tyler Bertuzzi has five goals and two assists over the past 10 games.\n\nCarter Verhaeghe has 14 goals and 24 assists for the Panthers. Sam Bennett has six goals and four assists over the last 10 games.\n\nLAST 10 GAMES: Blackhawks: 5-4-1, averaging 2.4 goals, four assists, 3.6 penalties and 8.9 penalty minutes while giving up 2.4 goals per game.\n\nPanthers: 6-4-0, averaging 2.4 goals, 3.4 assists, 5.4 penalties and 14.1 penalty minutes while giving up 3.2 goals per game.\n\nINJURIES: Blackhawks: None listed.\n\nPanthers: None listed.\n\nThe Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
				"source": {
					"uri": "hjnews.com",
					"dataType": "news",
					"title": "The Herald Journal"
				},
				"authors": [
					{
						"uri": "associated_press@hjnews.com",
						"name": "Associated Press",
						"type": "author",
						"isAgency": false
					}
				],
				"image": "https://bloximages.chicago2.vip.townnews.com/hjnews.com/content/tncms/custom/image/01d65bdc-75bc-11e9-a6ea-4f05c88a4606.jpg?resize=600%2C354",
				"eventUri": null,
				"sentiment": 0.1764705882352942,
				"wgt": 507033797,
				"relevance": 1
			},
			{
				"uri": "9058463665",
				"lang": "eng",
				"isDuplicate": true,
				"date": "2026-01-25",
				"time": "10:42:41",
				"dateTime": "2026-01-25T10:42:41Z",
				"dateTimePub": "2026-01-25T09:10:54Z",
				"dataType": "news",
				"sim": 0,
				"url": "https://www.news-gazette.com/panthers-play-the-blackhawks-following-marchands-2-goal-game/article_019ed9ae-2d60-5825-8303-dab33079e1ef.html",
				"title": "Panthers play the Blackhawks following Marchand's 2-goal game",
				"body": "The Florida Panthers visit the Chicago Blackhawks after Brad Marchand scored two goals in the Panthers' 4-3 overtime win over the Minnesota Wild\n\nFlorida Panthers (27-20-3, in the Atlantic Division) vs. Chicago Blackhawks (21-22-8, in the Central Division)\n\nChicago; Sunday, 7 p.m. EST\n\nBETMGM SPORTSBOOK LINE: Panthers -147, Blackhawks +123; over/under is 6\n\nBOTTOM LINE: The Florida Panthers visit the Chicago Blackhawks after Brad Marchand scored two goals in the Panthers' 4-3 overtime win against the Minnesota Wild.\n\nChicago is 11-12-5 at home and 21-22-8 overall. The Blackhawks have gone 6-7-4 in games decided by a goal.\n\nFlorida has a 27-20-3 record overall and a 13-10-0 record in road games. The Panthers have a -14 scoring differential, with 149 total goals scored and 163 allowed.\n\nThe teams match up Sunday for the second time this season. The Panthers won 3-2 in the previous matchup.\n\nTOP PERFORMERS: Connor Bedard has 20 goals and 27 assists for the Blackhawks. Tyler Bertuzzi has five goals and two assists over the past 10 games.\n\nCarter Verhaeghe has 14 goals and 24 assists for the Panthers. Sam Bennett has six goals and four assists over the last 10 games.\n\nLAST 10 GAMES: Blackhawks: 5-4-1, averaging 2.4 goals, four assists, 3.6 penalties and 8.9 penalty minutes while giving up 2.4 goals per game.\n\nPanthers: 6-4-0, averaging 2.4 goals, 3.4 assists, 5.4 penalties and 14.1 penalty minutes while giving up 3.2 goals per game.\n\nINJURIES: Blackhawks: None listed.\n\nPanthers: None listed.\n\nThe Associated Press created this story using technology provided by Data Skrive and data from Sportradar.",
				"source": {
					"uri": "news-gazette.com",
					"dataType": "news",
					"title": "The News-Gazette"
				},
				"authors": [],
				"image": "https://bloximages.newyork1.vip.townnews.com/news-gazette.com/content/tncms/custom/image/e462f33a-3c65-11ec-b3f1-2f038a8f66b4.jpg?resize=600%2C315",
				"eventUri": null,
				"sentiment": 0.1764705882352942,
				"wgt": 507033761,
				"relevance": 1
			},
			{
				"uri": "9058458179",
				"lang": "eng",
				"isDuplicate": true,
				"date": "2026-01-25",
				"time": "10:41:57",
				"dateTime": "2026-01-25T10:41:57Z",
				"dateTimePub": "2026-01-25T09:26:05Z",
				"dataType": "news",
				"sim": 0,
				"url": "https://investorshub.advfn.com/boards/read_msg.aspx?message_id=177216635",
				"title": "BB's Stock Haven : VTHO crypto to do a NICKEL+ surge..get i...",
				"body": "U.S. Stocks Turn In Mixed Performance Following Two-Day Rally\n\nAfter moving sharply higher over the two previous sessions, the major U.S. stock indexes turned in a mixed performance during trading on Friday. While the Dow gave back ground, the tech-heavy Nasdaq saw further upside, closing higher for the third straight day. The major averages finished the choppy trading day on opposite sides of the [...]\n\nNvidia Shares Edge Higher After Report Signals China May Greenlight H200 Chip Orders\n\nNvidia (NASDAQ:NVDA) shares gained around 1.5% on Friday after a Bloomberg report suggested that Chinese regulators are moving closer to approving imports of the company's H200 artificial intelligence chips. According to the report, Chinese authorities have informed several major technology groups that they may begin preparing orders for the advanced processors. Firms including Alibaba Group [...]",
				"source": {
					"uri": "investorshub.advfn.com",
					"dataType": "news",
					"title": "Investors Hub"
				},
				"authors": [],
				"image": "https://investorshub.advfn.com/images/ihub-master-logo-1200x600.png",
				"eventUri": null,
				"sentiment": 0.2627450980392156,
				"wgt": 507033717,
				"relevance": 1
			},
			{
				"uri": "9055071524",
				"lang": "eng",
				"isDuplicate": false,
				"date": "2026-01-25",
				"time": "10:41:45",
				"dateTime": "2026-01-25T10:41:45Z",
				"dateTimePub": "2026-01-22T17:43:50Z",
				"dataType": "news",
				"sim": 0.6196078658103943,
				"url": "https://www.morningstar.com/news/marketwatch/20260122219/microns-business-is-so-hot-that-profits-could-quadruple-in-just-two-years-says-this-analyst",
				"title": "Micron's business is so hot that profits could quadruple in just two years, says this analyst",
				"body": "A massive imbalance in memory supply and demand could benefit Micron through at least 2027, according to a William Blair analyst\n\nWilliam Blair initiated coverage of Micron's stock on Thursday.\n\nMemory chips have emerged as a key bottleneck to the artificial-intelligence buildout, and Micron Technology can keep cashing in on soaring prices for at least the next two years, according to an analyst.\n\nThe supply of memory products has been squeezed as AI chip makers have started rolling out advanced chips on an annual cadence. At the same time, memory and storage companies have been reluctant to add more capacity due to fears of oversupply in a historically cyclical industry. This severe supply-and-demand imbalance has given memory and storage makers more pricing leverage.\n\nWilliam Blair analyst Sebastien Naji expects tight supply to continue into 2027, setting Micron (MU) up to benefit from \"significant\" increases in average selling prices that boost the company's profitability.\n\nIn his view, Micron is the No. 2 memory supplier, and he expects its high-bandwidth-memory revenue to grow 164% in 2026 and 40% in 2027. Some of the company's other memory offerings should also benefit from the AI boom, he said.\n\nOver the next two years, Naji said, Micron's adjusted earnings per share could grow more than 275%.\n\nNaji initiated coverage of Micron with an outperform rating on Thursday, pointing to the \"memory supercycle\" that has sent the chip maker's shares up 256% over the last year.\n\nMicron, Samsung Electronics (KR:005930) and SK Hynix (KR:000660) are the top three suppliers in the world of HBM, a type of dynamic random-access memory that is in high demand from Nvidia (NVDA) and other AI-chip makers to meet the needs of increasingly advanced AI models.\n\nSee more: Why Micron's stock is a standout gainer as the market falters\n\nAs large language models get longer context windows, or the amount of data they can process at one time, HBM has become \"a critical enabler of the AI platform shift,\" Naji said. The growing need for HBM in next-generation chips means \"memory represents a growing share of the AI-infrastructure bill of materials.\"\n\nWhile Naji forecast a near quadrupling of adjusted EPS over a two-year span, he acknowledged several factors that could hamper growth in that metric, and in free cash flow. For one, he noted, Samsung, which had fallen behind on the HBM curve, now has its HBM3e qualified for use in Nvidia's chips. The South Korean chip maker also has a good relationship with Google and Broadcom (AVGO), Naji said, which work together on Google's tensor processing units that power the tech giant's Gemini AI models.\n\nMeanwhile, imbalances of supply and demand are expected to even out in the medium to long term, Naji said.\n\nMicron's stock is \"not necessarily expensive\" compared with other AI-semiconductor plays, Naji said. At a forward price-to-earnings multiple of 9.7x his estimate for 2026, the stock trades below its historical average of 11x, he noted.\n\nDon't miss: This could be a better - and safer - way into the AI trade in 2026\n\n-Britney Nguyen\n\nThis content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.",
				"source": {
					"uri": "morningstar.com",
					"dataType": "news",
					"title": "Morningstar"
				},
				"authors": [],
				"image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blta7dd42ebdd7b93b8/61899b34a3c7df383578294c/morningstar-og.png",
				"eventUri": "eng-11339035",
				"sentiment": 0.1215686274509804,
				"wgt": 507033705,
				"relevance": 1
			},
			{
				"uri": "9058411196",
				"lang": "eng",
				"isDuplicate": true,
				"date": "2026-01-25",
				"time": "10:41:18",
				"dateTime": "2026-01-25T10:41:18Z",
				"dateTimePub": "2026-01-25T08:33:56Z",
				"dataType": "news",
				"sim": 0,
				"url": "https://en.dahe.cn/2026/01-25/2047934.html",
				"title": "[more]",
				"body": "In the opening weeks of 2026, Chinese President Xi Jinping's intensive bilateral and multilateral interactions spanning China's neighboring regions, Europe, North America and the Global South, have drawn widespread attention across the world.\n\nAt a time when humanity once again stands at a crossroads, China's diplomacy under Xi's leadership opens a magnificent new chapter, demonstrating China's commitment to building a community with a shared future for humanity and promoting world peace and development.\n\nCONSTRUCTING CLOSER GLOBAL PARTNERSHIPS\n\nOn New Year's Eve, Xi and Russian President Vladimir Putin exchanged New Year greetings. Xi took a comprehensive look back at 2025, a year marking a concrete step in the China-Russia comprehensive strategic partnership of coordination for a new era, and expressed readiness to maintain close exchanges with Putin to jointly push for continuous new progress in bilateral ties in the new era.\n\nOn Jan. 5, Xi held talks with President of the Republic of Korea (ROK) Lee Jae Myung, the first foreign head of state visiting China in 2026.\n\nXi said he and President Lee have met twice and conducted reciprocal visits, reflecting the importance both sides attach to China-ROK relations. As both friends and neighbors, China and the ROK should increase exchanges and maintain frequent communication.\n\nOn the same day, Xi met with Taoiseach of Ireland Micheal Martin, whose visit to China marked the first by an Irish Taoiseach in 14 years. Xi summarized the valuable experience gained from the long-term stable development of bilateral ties, and said China is willing to strengthen strategic communication with Ireland, deepen political mutual trust and expand pragmatic cooperation to benefit the peoples of both countries and add momentum to China-EU relations.\n\nIn addition, Finnish Prime Minister Petteri Orpo will pay an official visit to China from Jan. 25 to 28, which is expected to further deepen bilateral relations.\n\nOn Jan. 16, Xi met with Canadian Prime Minister Mark Carney, whose visit to China marked the first by a Canadian prime minister in eight years. Xi put forward four proposals on bilateral relations, and called on both sides to steer their ties onto the track of sound, steady and sustainable development, and bring more benefits to both peoples.\n\nChina's new year diplomacy also highlighted its firm solidarity with the Global South. On the occasion of the 70th anniversary of launching diplomatic relations between China and Africa, Xi sent a congratulatory letter to the opening ceremony of the 2026 China-Africa Year of People-to-People Exchanges. Chinese Foreign Minister Wang Yi made his first overseas trip of the year to Africa, continuing a diplomatic tradition that has been carried out for 36 consecutive years.\n\nDuring a phone call with Brazilian President Luiz Inacio Lula da Silva on Jan. 23, Xi noted that China is committed to always being a good friend and partner to countries in Latin America and the Caribbean (LAC), and to jointly advancing the building of the China-LAC community with a shared future.\n\nThese events have highlighted China's sincere willingness to unite with Global South countries to address global challenges and jointly advance modernization.\n\nWith intensive and proactive diplomatic engagements in less than a month, China is deepening and expanding global partnerships that feature equality, openness and cooperation.\n\nSTRENGTHENING ECONOMIC AND TRADE CONNECTIONS\n\nXi's new year diplomacy has strongly conveyed to the international community China's clear and consistent commitment to upholding openness, cooperation, and joint development amid a world beset by unilateralism, protectionism, and hegemonism.\n\nDuring Lee's visit to China, Xi and Lee witnessed the signing of 15 cooperation documents between China and the ROK in fields including scientific and technological innovation, ecological environment, transportation, and economic and trade cooperation.\n\nMartin said Ireland is committed to developing the strategic partnership for mutually beneficial cooperation between the two countries, and is willing to deepen cooperation with China in trade, investment, science and technology, biomedicine, renewable energy, artificial intelligence, education and other fields.\n\nDuring Carney's visit, both sides issued a joint statement of the China-Canada leaders' meeting, and signed eight cooperation documents, including an economic and trade cooperation roadmap. The two sides also made specific arrangements to properly address trade issues related to electric vehicles (EVs), steel and aluminum products, rapeseed, and agricultural and aquatic products.\n\nAhead of Orpo's visit to China, the Finnish side noted that \"China is an important export market for Finnish companies and the EU's second largest trading partner,\" and the visit is expected \"to promote business opportunities for Finland in China.\"\n\nAs 2026 marks the beginning of China's 15th Five-Year Plan period, the momentum of various parties looking to embrace Chinese opportunities and pursue win-win cooperation clearly highlights the vast space for shared prosperity embedded in Chinese modernization.\n\nChina will open its doors still wider, and inject greater certainty and fresh momentum into the world through its high-quality development, so that countries will realize common development and shared prosperity, Xi said.\n\nDEEPENING PEOPLE-TO-PEOPLE BONDS\n\nFriendship, which comes from close contact between people, holds the key to sound state-to-state relations. Promoting people-to-people exchanges and mutual understanding stands as another highlight of China's head of state diplomacy at the beginning of 2026.\n\nWhen exchanging New Year greetings with Putin, Xi announced that 2026-2027 will be designated as the China-Russia Years of Education.\n\nDuring his talks with Lee, Xi called on both sides to increase personnel exchanges and promote interactions in areas such as youth, media, sports, think tanks and local governments.\n\nIn his meeting with Martin, Xi extended a warm welcome for more Irish youth to come to China for study and exchanges.\n\nResponding to a letter from a U.S. youth education exchange delegation comprised of teachers and students, Xi said he looks forward to more American youth joining the cause of China-U.S. friendship, becoming a new generation of envoys of friendship between the two countries, and making greater contributions to enhancing people-to-people exchanges and promoting the development of bilateral relations.\n\nXi's diplomatic style has showcased to the world the distinct traits of China's foreign policy -- treating all nations as equals and upholding a long-term vision -- and embodied the grandeur of Chinese civilization that is inclusive and embraces the diversity of all cultures.\n\nIn today's context, the broad-mindedness to replace civilizational estrangement and clashes with exchanges and mutual learning is particularly precious.\n\nADVANCING MULTILATERALISM FOR SHARED FUTURE\n\n\"The world today is undergoing both changes and turbulence, and some regions are still engulfed in war. China always stands on the right side of history, and is ready to work with all countries to advance world peace and development and build a community with a shared future for humanity,\" Xi said in his 2026 New Year message, reflecting deep concern for the evolving global landscape.\n\nFacing the severe challenge of fragmented global governance, China adheres to practicing true multilateralism. While managing its own affairs well, the country strives for human progress, emerging as a driving force for peaceful development and a stabilizer in a turbulent world.\n\nAll countries should respect the development paths chosen by the peoples of other nations, and abide by international law as well as the purposes and principles of the UN Charter, Xi said, stressing that major countries should particularly take the lead in doing so.\n\nXi's point of view demonstrates the country's sense of responsibility for humanity's shared future.\n\nDivision, confrontation and zero-sum games have no future, and returning the world to the law of the jungle is unpopular. Instead, global solidarity and cooperation represents the only right path forward. Xi's statement, made to newly appointed ambassadors to China, has found broad resonance.\n\nAt this critical historical juncture, where human society yearns for stability, reliability and direction, President Xi has steered China's major-country diplomacy with Chinese characteristics to a steady start in 2026, injecting into the world vital hopes for stable progress, broad opportunities for cooperation and positive forces for win-win outcomes.",
				"source": {
					"uri": "en.dahe.cn",
					"dataType": "news",
					"title": "en.dahe.cn"
				},
				"authors": [],
				"image": null,
				"eventUri": null,
				"sentiment": 0.3490196078431373,
				"wgt": 507033678,
				"relevance": 1
			},
			{
				"uri": "9058451914",
				"lang": "eng",
				"isDuplicate": false,
				"date": "2026-01-25",
				"time": "10:29:33",
				"dateTime": "2026-01-25T10:29:33Z",
				"dateTimePub": "2026-01-25T09:10:00Z",
				"dataType": "news",
				"sim": 0,
				"url": "https://coloradosun.com/2026/01/25/sunlit-ellen-kingman-fisher-the-ring-of-a-bell/",
				"title": "Ellen Kingman Fisher channeled historical novels in three distinct voices",
				"body": "Ellen Kingman Fisher is a longtime Colorado resident specializing in historical novels. She has a PhD in history from the University of Colorado Boulder, and is a former chair of the Colorado Historical Society. Fisher is the author of \"Hill's Gold,\" \"The Price of a Contract\" and \"The Ring of a Bell.\"\n\nSunLit: Tell us this book's backstory - what's it about and what inspired you to write it?\n\nEllen Kingman Fisher: The protagonist of my first book, \"Hill's Gold,\" was Nathaniel Hill, who came to Colorado from Brown University in the 1860s to assess Colorado's mining. He eventually became one of Colorado's first U.S. Senators. He appears in each of my first three books, but only once as the main character.\n\nThe protagonist of my second book, \"The Price of a Contract,\" is Kate Sinclair (Hill's wife's best friend), an intrepid woman who takes one of the first transcontinental trains across the country. The protagonist in my third book, \"The Ring of a Bell,\" is a teenage boy raised by a single mother; he knew little about his father.\n\nSunLit: Place the excerpt you selected in context. How does it fit into the book as a whole, and why did you select it?\n\nFisher: My protagonist, Herb, grows up with many challenges and unknowns. As he attempts to shape his future, his past reveals itself in bits and pieces. The excerpt shows how the past influences his life -- something true for everyone, though every situation is unique.\n\nSunLit: What influences and/or experiences informed the project before you sat down to write?\n\nFisher: I like to teach history through fiction -- stories are the best way to learn and remember history. I'm also interested in technology and entrepreneurs. My stories are always about people, but technology plays a role. I also like secrets.\n\nSunLit: What did the process of writing this book add to your knowledge and understanding of your craft and/or the subject matter?\n\nFisher: I wanted to challenge myself to write from the perspectives of a man, a woman, and a teenager. Each required different nuances of the craft of writing. I also had to delve deeply into the time period and various technologies.\n\nSunLit: What were the biggest challenges you faced in writing this book?\n\nFisher: Making a story from historical chronology. Non-fiction would have been easier.\n\nSunLit: What do you want readers to take from this book?\n\nFisher: The effect of keeping secrets on ourselves and others . . . and also the amazing ways technology changes our lives.\n\nSunLit: Does the term \"Don't fail\" ring true, or is it bad advice? In what ways does the book disprove that statement?\n\nFisher: \"The Ring of a Bell\" has many stories: a teenage boy in the 1870s, a single mother in a time when women had little power, and inventors like Alexander Graham Bell. Success did not come for any of them without previous, sometimes painful failures. It's a lesson for life.\n\nSunLit: Tell us about your next project.\n\nFisher: Edwin James, who came to Colorado as a young doctor, botanist, and geologist with the 1820 Stephen Long expedition. He discovered the columbine and was the first recorded man to climb Pikes Peak -- and that's just the beginning of his story.\n\nA few more quick items\n\nCurrently on your nightstand for recreational reading: \"Skylark,\" Paula McLain's new historical novel that will be released soon. So far, my favorite book ever.\n\nFirst book you remember really making an impression on you as a kid: \"The Scarlet Letter.\" It took me a decade or more to understand it.\n\nBest writing advice you've ever received: As you sit down to write, read something beautifully written -- it's like doing calisthenics before a sports activity.\n\nFavorite fictional literary character: Anna Karenina\n\nLiterary guilty pleasure (title or genre): None -- I have a big stack of meaningful books on my nightstand, I'm eager (desperate?) to have the time to read.\n\nDigital, print, or audio - favorite medium to consume literature: I switch between print and electronic, but I also like audiobooks when I do my daily 10,000 steps.\n\nOne book you've read multiple times: \"Angle of Repose.\"\n\nOther than writing utensils, one thing you must have within reach when you write: A small notebook to jot down ideas, things not to forget, or historical data (I'm a historical novelist, after all.)\n\nBest antidote for writer's block: Start writing anything -- it may be discarded, but it's something on the page and may start new ideas.\n\nMost valuable beta reader: My grandson, Hadley Fisher, although studying engineering, he read \"The Ring of a Bell\" when he was the same age as my protagonist, and gave me valuable insights into teenage boys.",
				"source": {
					"uri": "coloradosun.com",
					"dataType": "news",
					"title": "The Colorado Sun"
				},
				"authors": [
					{
						"uri": "colorado_sun@coloradosun.com",
						"name": "Colorado Sun",
						"type": "author",
						"isAgency": false
					}
				],
				"image": "https://i0.wp.com/newspack-coloradosun.s3.amazonaws.com/wp-content/uploads/2026/01/Ellen-Kingman-Fisher-logo.png?fit=1200%2C800&quality=80&ssl=1",
				"eventUri": null,
				"sentiment": 0.1294117647058823,
				"wgt": 507032973,
				"relevance": 3
			},
			{
				"uri": "9058432578",
				"lang": "eng",
				"isDuplicate": false,
				"date": "2026-01-25",
				"time": "10:28:50",
				"dateTime": "2026-01-25T10:28:50Z",
				"dateTimePub": "2026-01-25T05:27:13Z",
				"dataType": "news",
				"sim": 0,
				"url": "https://www.techi.com/flying-cars-beyond-the-sci-fi-dream-closer-to-reality/",
				"title": "Flying Cars: Beyond the Sci-Fi Dream, Closer to Reality",
				"body": "There has always been something magical about cars that could fly. We never thought that those flying cars in movies and cartoons would become a reality one day. How can we forget the frequent traffic jams that made us dream about flying cars? But that dream once felt nearly impossible. Although it used to seem quite easy in movies, it was totally different in reality. We didn't have the engines, batteries, or control systems to build them back then. But lightweight materials, smart control systems, and technology achievements have made our dream come true over time.\n\nMany companies are already testing real prototypes that can take off, fly, and land safely in 2025. According to reports, the global flying car market is expected to reach around USD 264.5 billion by 2025, and could grow to over USD 6.56 trillion by 2034. It is expanding at a CAGR of about 42.9%. Researchers also said that short airborne trips are possible with modern lithium-ion batteries and advanced flight-control systems of the cars, but still flying cars aren't ready for everyday use. They are undergoing tests and safety certifications, which means we might have to wait a few more years before we can see them.\n\nBut these flying cars raise many serious concerns. People often debate whether they are safe to travel in any region. What are the infrastructure requirements, and how long will it take to launch them? Therefore, we will discuss the features, limitations, and challenges of flying cars in this blog. We also explain how they work and who the key players are. How much progress has been made so far, and who is behind this concept?\n\nConcept to Prototype of Flying Cars\n\nThe idea of flying cars isn't new. It dates back to the late 1900s when the famous science fiction writer, Jules Verne wrote his Master of the World novel. He wrote about a Terror vehicle machine that could drive, sail, and fly. It was just an imagination back then, but no one knew that it would become reality one day. The transportation industry was changing a lot after World War II. Airplanes were becoming common, and car companies also jumped in with the \"concept cars\". They presented the idea of wings at auto shows, such as Ford's Volante and General Motors' Firebird series in the 1950s.\n\nBut the journey officially began in 1917 when Glenn Curtiss introduced the Curtiss Autoplane. It is often called the world's first flying car. The Autoplane machine had a car body with wings and a tail attached. But it was quite a failed project due to technological limitations, and then Moulton Taylor launched the Aerocar. It was able to drive on roads and fly with its detachable wings. Aerocar also received certification from the U.S. Civil Aeronautics Administration in 1956, but only six units were built at that time. But people never stopped working on this concept.\n\nCurtiss Autoplane\n\nEntrepreneur Paul Moller introduced the M400 Skycar in the 2000s. He promised vertical takeoff, sleek design, and fast travel, but all of this hype was of no use. Skycar never reached the market despite global media attention due to funding issues. The cost was too high, the engines were inefficient, the rules were complicated, and people weren't ready to trust the skies to cars. All of these factors led to the failure of this project, but tech giants never stopped working on this. We have witnessed multiple projects, even after Skycar that made our flying car dream successful today.\n\nAerocar\n\nM400 Skycar\n\nRise of Flying Cars\n\nAlthough the prototype and concept of building flying cars were already there, we didn't have the right technology to make them fly safely. The real flying car growth in this sector started in the 2010s, when electric propulsion, artificial intelligence, and lightweight materials came into the spotlight. Companies started to replace their traditional jet engines with lighter and quieter electric motors. These motors were more sustainable than an engine. As Sebastian Thrun, founder of Kitty Hawk said about this technology,\n\nI believe we're going to be done with self-flying vehicles before we're done with self-driving cars.\n\nThrun summed up the whole scenario of what was happening at that moment. But everything changed when startups like Joby Aviation, Lilium, and Volocopter began testing eVTOL (electric Vertical Takeoff and Landing) aircraft. It means vehicles can take off from rooftops or parking lots without long runways. Thrun said,\n\nI personally don't like the word 'flying car,' but it's very catchy. The technical term is called eVTOL. These are typically electrically propelled vehicles, which can take off and land vertically, eVTOLs, vertical take-off and landing, so that you don't need an airport. And then they fly very much like a regular plane.\n\nBut building these vehicles wasn't as easy as sketching them in our dreams. There was a need for a strong, light, and safe material to build these flying cars, and this was the time when manufacturers thought about carbon-fiber composites. It is the same material used in modern aircraft and Formula 1 cars. Daniel Wiegand, co-founder of Lilium Jet, once said,\n\nWe needed materials that are light enough to fly, yet strong enough to keep passengers safe.\n\nApart from this, many tech giants started working on batteries that last longer and charge quickly. NASA's Dr. Parimal Kopardekar, who leads the Advanced Air Mobility project noted in a report that battery innovation is advancing so quickly that practical air travel is \"no longer a matter of if, but when.\" All of these technologies and advancements push flying cars out of labs and into the skies. Companies like Joby Aviation in the U.S., Lilium in Germany, and SkyDrive in Japan have already conducted successful flight tests. They are now working for certification so that we can also enjoy rides by 2026 to 2027.\n\n5 Big Players in Flying Cars\n\nHere are the big players in flying cars:\n\n1. PAL-V Liberty Flying Car\n\nWe all have felt the frustration of being stuck in traffic. It irritates us most when we are running out of time or have to attend some important events. But PAL-V Liberty is designed to tackle our traffic-related problems. It is the world's first road-legal gyroplane-based flying car that can glide down safely even if the engine fails. PAL-V Liberty has a rotor and propeller system so we can take it off anywhere in a small open area instead of long runways. But the best part is that it runs on regular petrol instead of some rare fuels. PAL-V Liberty is best for long trips due to its 1,200 km of driving range and 400-500 km of flying range. According to CEO Robert Dingemanse,\n\nWhat makes our vehicle unique is that it can fly and drive, which is much more versatile than one that just flies.\n\nPAL-V Liberty runs up to 160 km/hr (99 mph) on the road and 180 km/hr (112 mph) in flight. It also achieved a certification from the European Union Aviation Safety Agency (EASA) on both road and air use. But public reactions were mixed when it was launched in London. A Reddit User shared in a thread:\n\nThe idea will quickly become abandoned like every other flying car venture before it. It's not a good car, and it's not a good aircraft. It's a compromise on both fronts and excellent at nothing.\n\nPeople also shared that it's not legal to land it in parks, but Robert Dingemanse shared in his interview that it complies with existing aviation regulations. The standard model of this flying car costs around $399,000 (€299,000), but the limited-edition Pioneer model is more expensive with a price tag of around $599,000 (€499,000). But it is still not launched for public use yet.\n\n2. AeroMobil 5.0\n\nAeroMobil 5.0 works as both a car and a small aircraft. So we can travel on the road and even fly in the air without any worries. The company says that AeroMobil 5.0 is not just a flying car, it's a whole new way of traveling. AeroMobil 5.0 also uses vertical takeoff and landing (VTOL) technology to take off without needing long runways. It has two electric rotors and a rear propeller like the PAL-V Liberty flying car. But the feature that sets it apart from PAL-V Liberty is its four-passenger seat. It means we can travel with family or friends. AeroMobil CEO Juraj Vaculik said,\n\nOur strategy solves the limitations of alternative VTOL concepts, which are tied to dedicated landing pods rather than also using the existing road infrastructure.\n\nMany people are praising how smoothly it switches to flight mode within three minutes. A Reddit user wrote in a thread.\n\nIf you don't have to fly very far, it might be a superior option to using commercial airliners, and require far less infrastructure (no huge runways) to support.\n\nAeromobile was announced in 2018, but there is no public demo available yet. It's just a prototype, but the company plans to launch it in the coming years after testing.\n\n3. Joby's Electric Air Taxi\n\nJoby Aviation has built a flying car that flies, while many companies are still struggling. It is a vertical‐takeoff-and-landing (eVTOL) aircraft that can carry a pilot and four passengers at about 200 mph (320 km/h). Although its design looks like a helicopter, it's about 95% quieter than a helicopter. This aircraft is electric, which means no fuel emissions. But it didn't just build within months. Joby was working on flying car prototypes from 2017. They first showcased their technology in New York City in 2023, but they completed their first pilot test flights in Dubai in June 2025. JoeBen Bevirt, founder and CEO of Joby Aviation said,\n\nThe United Arab Emirates is a launchpad for a global revolution in how we move.\n\nIt is also the first flying car to take flight between two public airports in the US. This electric air taxi departed from Marina (OAR) and landed at Monterey (MRY) airport in just 12 minutes. It covered almost 11½ miles. The company called this flight \"a major step as part of Joby's commercial market readiness.\" But many people are comparing this electric car to helicopters. But a Reddit user said,\n\nJoby has a few years' lead. I believe that once they are in true passenger revenue mode and the economics are proven, they will be able to finance capacity with debt and grow pretty fast.\n\n4. Klein Vision AirCar\n\nKelvision also jumped into flying cars to tell us that such innovation exists. They released their prototype of a flying car at the Living Legends of Aviation Gala in Beverly Hills in May 2025. Stefan Klein said,\n\nThe AirCar fulfills a lifelong dream to bring the freedom of flight into the hands of everyday people. With the launch of our production prototype, we are one step closer to transforming how the world moves, merging the road and the sky into a new dimension of personal mobility.\n\nThey have built this vehicle to serve us in ways that traditional cars or planes can't. We can drive it like a regular vehicle and can also fly it like a plane in two minutes. It runs up to 124 miles per hour on the road and up to 155 miles per hour in the air. It means we can travel around 620 miles without stopping again and again for fuel or charging. But public reaction was more skeptical of its prototype. A Reddit user said in a thread.\n\nSomething like that can never be truly good at either of the things it tries to do. It will be a handicapped car and also a handicapped plane.\n\nMany people question why they are working on flying cars when planes already exist. Others called it a thing only for rich people. But Kelvin is planning to do something bigger. They are going to launch it for customers in the first quarter of 2026, with a starting price estimated between USD $800,000 and $1.2 million. The actual price will depend on engine choice and customization.\n\n5. Alef Aeronautics' Model Zero\n\nAlef Aeronautics released a prototype of \"Model Zero\" in early 2025. It can drive on roads like a regular car and also take off vertically to fly. This is the first flying car that has the same shape as a car, unlike Joby's taxi which looks like a plane. They conducted the sustainability test of Model Zero in February 2025. Alef released the video where this car was flying over the vehicles, and the CEO was standing nearby. Jim Dukhovny, CEO of Alef, commented,\n\nThis drive and flight test represents an important proof of technology in a real-world city environment. We hope it will be a moment similar to the Wright Brothers' Kitty Hawk video, proving to humanity that new transportation is possible.\n\nBut people are saying that it looks exactly like the 1960s sci-fi vision of a flying car. They also said that it's just a drone in a car's body. A Reddit user even pointed out if the test video is true or not,\n\nAre we actually sure someone is riding it in that video, though? It looks so flimsy and unstable, I'm not convinced it can actually carry a person.\n\nMany people said that the CEO didn't let them film the inside of the \"car\" and wouldn't allow them close-ups of the car. They also said that this prototype is just an investor-bait. But there is no response from the company yet. Only time will reveal if these speculations were true or not.\n\nRegulatory and Safety Challenges\n\nSafety concerns pop up immediately when we see flying cars. They seem quite inappropriate and risky. Our skies were already crowded with commercial jets, helicopters, drones, private aircraft, and this flying car is an addition. But people shared their safety concerns when two flying-car type eVTOLs collided and one caught fire during an air-show rehearsal in Jilin province of China. This incident showed that there is a danger and system failures in these innovative flying cars.\n\nEveryone started debating and sharing their concerns about what if batteries overheat and systems fail. Who will be liable in a crash, the manufacturer, the pilot, or the software? But apart from this incident, many of us are scared of being a passenger in a flying car. It sounds scary that we will be in the air and no one will be there to help us. There is a need for proper regulation from the government. Therefore the European Union Aviation Safety Agency (EASA) created new rules to manage flying cars and air taxis. These rules explain how pilots will be trained and licensed, how air traffic will be controlled, and how these vehicles can safely share the sky.\n\nThe Federal Aviation Administration (FAA) also introduced new laws in late 2024 in the US. They added flying cars, known as eVTOLs (electric vertical take-off and landing vehicles), as a new type of aircraft. These rules are made to ensure that both pilots and aircraft meet strict safety and training standards before anyone can fly them.\n\nConclusion\n\nThere is no doubt that we will be driving flying cars one day. Every innovation from the PAL-V Liberty and AeroMobil 5.0 to Joby's electric air taxi, Klein Vision's AirCar, and Alef Model Zero reminds us that it's true. We don't have to wait an hour in the traffic jams, and we will just fly just like we used to dream back in childhood.\n\nBut it's not that easy because governments are still building rules, safety checks, and public trust will take time. These challenges are signs of progress that everyone is preparing for flying cars. We're not there yet, but we are closer than we think. Because the sky is no longer the limit.\n\nFAQs 1. Are flying cars real today?\n\nYes, several prototypes like AeroMobil and PAL-V Liberty have completed test flights and received partial certifications.\n\n2. How safe are flying cars?\n\nThey're designed with multiple backup systems, AI navigation, and strict testing standards. But theri public use is still pending.\n\n3. When will flying cars be available to the public?\n\nCommercial flying taxis may be available from 2026 to 2030.\n\n4. How much will a flying car cost?\n\nA flying car costs between $300,000 and $1 million, but prices may drop over time.\n\n5. Will flying cars harm the environment?\n\nMost of the electric cars are electric and cleaner than airplanes or gas cars, but there are challenges like battery disposal and power sourcing.",
				"source": {
					"uri": "techi.com",
					"dataType": "news",
					"title": "るなてち"
				},
				"authors": [
					{
						"uri": "ali_sher@techi.com",
						"name": "Ali Sher",
						"type": "author",
						"isAgency": false
					}
				],
				"image": "https://www.techi.com/wp-content/uploads/2013/05/Terrafugia-Flying-Car.jpg",
				"eventUri": null,
				"sentiment": 0.223529411764706,
				"wgt": 507032930,
				"relevance": 7
			},
			{
				"uri": "9058411198",
				"lang": "eng",
				"isDuplicate": false,
				"date": "2026-01-25",
				"time": "10:28:30",
				"dateTime": "2026-01-25T10:28:30Z",
				"dateTimePub": "2026-01-25T08:33:56Z",
				"dataType": "news",
				"sim": 0.7529411911964417,
				"url": "https://en.dahe.cn/2026/01-25/2047933.html",
				"title": "Chinese e-mobility company eyes US market for expansion",
				"body": "NAVEE, a Chinese company that aims to address modern mobility through technology, is poised to tap into the US market to expand its global footprint.\n\nFounded in 2021, the company designs and manufactures electric scooters and electric golf carts for international markets. This year, the company began adding AI-enabled features to some of its products.\n\nDuring an event on Friday in Mountain View, California, NAVEE introduced several new products and models, including a space-expanding trailer, an energy storage robot, an exoskeleton, a personal aerial mobility device, and an electric vertical take-off and landing aircraft.\n\nNearly all the new products unveiled at the event feature AI technology. The energy storage robot and the exoskeleton are expected to hit the US market next quarter, while the other products are still in long-term development, according to Mauricio Magallon, NAVEE's sales manager for the United States.\n\nThe energy storage robot, Magallon explained, is not \"just a battery\" but a \"mobile energy companion\" that addresses three core challenges: mobility, charging efficiency and gear handling.\n\nIt can follow the user automatically and deliver power where it's needed, he said, and it can also follow the sun to optimize solar power collection.\n\nThe device's robotic arm can carry and handle gear alongside the user, said Magallon, adding \"think of it as an extra pair of hands everywhere you go.\"\n\nThe exoskeleton, with AI features, is designed to quickly adapt to user movements and terrain to support daily mobility.\n\n\"AI calibration means that in just five minutes, it learns how you move and what your body needs,\" Magallon said. \"It analyzes the ground around you and adjusts automatically. No more switching, no guesswork. You move and it adapts.\"\n\nMagallon also introduced an AI-powered electric golf push cart from an existing product line that can follow users via embedded cameras and hand gestures while avoiding obstacles and navigating courses.\n\n\"A hand gesture tells it to start following, or you can use your voice to start or stop, totally hands-free,\" he said. \"This cart is designed to be compact, weighing only 33 pounds, including the battery.\"\n\nThe company currently sells electric scooters and electric golf push carts in the US through its own website and other retailers, including Amazon.\n\nSince entering the US market three years ago, NAVEE has experienced rapid growth, building on its success in the European market, Magallon said.\n\n\"We've seen 300 percent growth last year in the US,\" he said, though he did not disclose revenue figures.\n\nThe company views the US as \"a pivotal market\" in its global growth strategy. \"As one of the world's most influential mobility, technology and lifestyle markets, the US sets the pace for how new mobility solutions are adopted, regulated and scaled,\" the company said in a news release.",
				"source": {
					"uri": "en.dahe.cn",
					"dataType": "news",
					"title": "en.dahe.cn"
				},
				"authors": [],
				"image": null,
				"eventUri": "eng-11339745",
				"sentiment": 0.2627450980392156,
				"wgt": 507032910,
				"relevance": 3
			},
			{
				"uri": "9058405959",
				"lang": "eng",
				"isDuplicate": true,
				"date": "2026-01-25",
				"time": "10:28:30",
				"dateTime": "2026-01-25T10:28:30Z",
				"dateTimePub": "2026-01-24T08:48:00Z",
				"dataType": "news",
				"sim": 0,
				"url": "https://www.thetimesnews.com/online_features/press_releases/catl-and-the-ellen-macarthur-foundation-set-direction-for-circular-ev-batteries-with-landmark-whitepaper/article_4b20f5df-dfd6-5d11-9b52-7f371e7ac713.html",
				"title": "CATL and the Ellen Macarthur Foundation Set Direction for Circular EV Batteries with Landmark Whitepaper",
				"body": "DAVOS, Switzerland, Jan. 24, 2026 /PRNewswire/ -- Leading The Charge - Turning risk into reward with a circular economy for EV batteries and critical minerals, a whitepaper released by the Ellen MacArthur Foundation during the World Economic Forum Annual Meeting 2026, marks the first integrated, actionable circular value-chain roadmap for EV batteries grounded in real-world industrial practice. It also sets a landmark milestone in the cooperation between CATL and the Foundation.\n\nDeveloped with input from over 30 leading organizations across the EV battery ecosystem -- including CATL, DHL, Volvo, and JLR, alongside research institutions and NGOs -- the report sets out a clear, industry-informed direction for how EV batteries must be designed, used, recovered, and reintegrated to maximise value and reduce systemic risk across the value chain.\n\nAs the founding strategic partner of The Foundation's Critical Minerals Mission, CATL worked closely with The Foundation and industry peers to translate circular economy principles into practical, deployable actions grounded in real operating experience. The roadmap also supports CATL's Global Energy Circularity Commitment, including its long-term goal to decouple battery growth from virgin raw material extraction.\n\nIt highlights the opportunities a circular EV battery system can unlock across environment, economy, product, and broader value creation. By keeping batteries and their critical minerals in use across multiple lifecycles, it reduces demand for newly mined materials, lowers emissions, and supports renewable energy integration. It also increases economic value by improving material efficiency, lowering waste and operational costs, and creating new revenue streams. At the same time, it strengthens supply chain resilience and distributes economic benefits more equitably across regions, showing that a systemic, circular approach transforms potential risks into strategic, value-generating opportunities.\n\nFive bright spots to unlock a circular EV battery system\n\nThe whitepaper identifies five interdependent actions needed to keep battery materials in high-value use and strengthen system resilience:\n\nDesign batteries for circularity, not disposalRethink battery service within optimized energy-mobility systemsScale circular business models that treat batteries as long-term assetsBuild and co-invest in regional circular infrastructureEnable a circular operating system through data, standards, and policy\n\nCATL actions already in practice\n\nCATL is already putting these system-level actions into practice across its operations. By separating the battery from the vehicle, CATL manages batteries as centrally managed assets, increasing utilization, enabling scheduled maintenance, and ensuring predictable return at end of use. Today, CATL operates more than 1,000 passenger-vehicle and over 300 commercial-vehicle swap stations, supported by a growing ecosystem of more than 100 partners.\n\nThis system integration enables high-quality recovery at scale. CATL's recycling operations achieve recovery rates of 99.6% for nickel, cobalt, and manganese, and 96.5% for lithium, with processing capacity expanding toward 270,000 tonnes per year. In parallel, CATL is applying alternative chemistries such as sodium-ion batteries, using widely available materials and reducing lifecycle carbon emissions per kilowatt-hour by up to 60%, reinforcing circular performance across mobility, swapping, and energy storage applications.\n\nScaling together\n\nSpeaking at The Foundation's Leadership Briefing among CATL Jiang Li, Vice-Chairman and Board Secretary of CATL highlighted: \"This report marks a major milestone in the global journey towards a circular battery economy. Circular battery systems must now be scaled across regions, industries, and applications -- from EVs to energy storage -- and adapted to diverse market contexts.\"\n\n\"As EV adoption accelerates, a circular economy for batteries and critical minerals is no longer optional -- it is essential to affordability, resilience, and long-term growth while reducing environmental and social impacts,\" said Wen-Yu Weng, Executive Leader for Critical Minerals at the Ellen MacArthur Foundation. \"EV batteries are strategic assets, and circular approaches are key to retaining their value and ensuring critical minerals never become waste. We welcome CATL's contribution and look forward to continued collaboration to help scale a truly circular battery system and support the wider energy transition.\"\n\nFor CATL, this agenda directly underpins its pathway to carbon neutrality -- building on the achievement of carbon neutrality across all its battery plants, and its target to achieve carbon neutrality across the full value chain by 2035.\n\nThe launch of the report marks an early milestone in CATL and The Foundation's broader collaboration to accelerate circularity of critical minerals. The next phase will focus on stress-testing these approaches in real-world environments, to understand how design, use, life extension, collection, and recycling loops function together at scale.\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/catl-and-the-ellen-macarthur-foundation-set-direction-for-circular-ev-batteries-with-landmark-whitepaper-302669414.html\n\nSOURCE Contemporary Amperex Technology Co., Limited (CATL)",
				"source": {
					"uri": "thetimesnews.com",
					"dataType": "news",
					"title": "thetimesnews"
				},
				"authors": [],
				"image": "https://bloximages.chicago2.vip.townnews.com/thetimesnews.com/content/tncms/assets/v3/editorial/f/a9/fa9c9be8-3b41-5eb5-8239-b6fd843ec05a/6975c8ea7d21a.image.jpg?crop=990%2C520%2C144%2C0",
				"eventUri": null,
				"sentiment": 0.2470588235294118,
				"wgt": 507032910,
				"relevance": 1
			}
		],
		"totalResults": 346394,
		"page": 1,
		"count": 10,
		"pages": 34640
	}
}